Workspace/OpenFOAM-plus-OpenFOAM-v1812/tutorials/compressible/rhoCentralFoam/LadenburgJet60psi/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
1200
(
(317.491053856625 0.029669972398158 0)
(325.38872067425 0.265360255017722 0)
(336.952319588932 0.826182180243691 0)
(351.468964321815 1.78008287533012 0)
(368.042822287271 3.10138643143382 0)
(385.895797893 4.72274118060121 0)
(404.192455736044 6.4833254504141 0)
(422.497898513147 8.34175167756579 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (315.6 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector>
20
(
(568.644342321213 14.9108420960903 0)
(568.692201605545 22.4401068652528 0)
(565.125185031646 37.3591796019525 0)
(559.09357175829 47.9226261951586 0)
(550.658139470085 49.871117596685 0)
(536.494237311041 44.0737870732293 0)
(518.368048109172 30.6252073839412 0)
(501.566020930653 17.838814439002 0)
(484.946265203009 16.7943155659551 0)
(471.432409298256 12.5491988451456 0)
(458.468511630066 6.23274727342688 0)
(428.819511398276 11.9765365951881 0)
(375.376233128667 4.11247224221608 0)
(301.971641732695 4.61312236028936 0)
(221.766777659224 5.50817077812216 0)
(153.056537554688 0.661525673338758 0)
(105.321920392051 3.172248815684 0)
(79.0175933514075 0.447238520740311 0)
(67.8543351560155 1.85489017389439 0)
(64.8525830146671 0.603268751774797 0)
)
;
    }
    freestreamInlet
    {
        type            noSlip;
    }
    freestream
    {
        type            zeroGradient;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
